<!DOCTYPE html>
<html  @if (\App::getLocale() == 'ar') direction="rtl" dir="rtl" style="direction: rtl"
       @else direction="ltr" dir="ltr" style="direction: ltr"@endif >
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="Description" content="شركة دار البناء للمقاولات">
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
    <meta name="Author" content="شركة دار البناء للمقاولات">
    <link rel="icon" href="{{asset('assets/img/favicon.ico')}}" type="image/png">
    <meta name="Keywords" content="شركة دار البناء للمقاولات"/>
    <title>
        {{__('main.system_name')}}
    </title>
    @include('employee.layouts.head')
    <style>
        .select2-selection__rendered {
            line-height: 50px !important;
            border-radius: 0 !important;
        }

        .select2-container .select2-selection--single {
            height: 50px !important;
            border-radius: 0 !important;
        }

        .select2-selection__arrow {
            height: 50px !important;
            border-radius: 0 !important;
        }

        .select2-search__field {
            height: 50px !important;
            line-height: 50px !important;
            outline: 0 !important;
        }

        .select2-container .select2-dropdown .select2-search__field {
            height: 45px !important;
        }

        table tr td {
            font-size: 14px !important;
        }
    </style>
</head>
<body  @if (\App::getLocale() == 'ar') direction="rtl" dir="rtl" style="direction: rtl"
       @else direction="ltr" dir="ltr" style="direction: ltr"@endif>
<div id="layout-a" class="theme-blue">
@include('employee.layouts.main-sidebar')
<!-- main body area -->
    <div class="main px-xl-5 px-lg-4 px-md-3">
        @include('employee.layouts.main-header')
        @yield('content')
        @include('employee.layouts.footer')
    </div>
    <div class="modal fade" id="exampleModal100" tabindex="-1" aria-labelledby="exampleModalLabel100"
         aria-hidden="true">
        <div class="modal-dialog modal-lg">
            <div class="modal-content">
                <div class="modal-header text-center">
                    <h5 class="modal-title w-100" id="exampleModalLabel100">
                        {{__('main.terms_and_conditions')}}
                    </h5>
                    <button type="button" class="btn btn-default btn-md btn-close" data-bs-dismiss="modal">
                        <i class="fa fa-close"></i>
                    </button>
                </div>
                <div class="modal-body text-right">
                    <div class="form-group">
                        <h4> شروط العمل:</h4>
                        <h6>إن هذا العقد وخدمة الموظف مشروطان بما يلي:</h6>
                        <p>
                        أ- أن يكون الموظف لائقاً طبياً للعمل في المملكة.
                        <br>
                        ب- استلام صاحب العمل مراجع توظيف سابقة وشهادات للموظف يرى أنها كافية وتفي بالحاجة.
                        <br>
                        صرّح الموظف وتعهد لصاحب العمل بأنه لا يترتب على إبرام هذا العقد أو تنفيذ التزاماته المنصوص عليها
                        فيه أي مخالفة لأي أمر قضائي أو أي شرط صريح أو ضمني في أي عقد أو أي التزام آخر ملزم له، بما في
                        ذلك على سبيل المثال لا الحصر أي مهلة إنذار أو أي شرط خاص بأي تعهدات تقييدية أو التزامات تتعلق
                        بسرية المعلومات أو بالملكية الفكرية الناشئة عن أي عمل له لدى أي صاحب عمل آخر أو صاحب عمل سابق.
                        </p>
                        <h4>الواجبات:</h4>
                        <h6> يلتزم الموظف طوال مدة خدمته بالمسائل الآتية:</h6>
                        <p>
                        أ- أن يلتزم بحسن السلوك والأخلاق أثناء العمل وفي جميع الأوقات يلتزم بالأنظــــــمة والأعراف
                        والعــــادات والآداب المرعية في المملكة العربية السعودية وكذلك بالــقواعد و اللوائح و
                        التعلـــيمات المعمــــول بها لدى صاحب العمل و يتــــحمل كافة الغرامات المالية الناتجة عن مخالفته
                        لتلك الأنظمة.
                        <br>
                        ب- أن ينجز العمل الموكل إليه وفقاً لأصول المهنة، و وفق تعليمات صاحب العمل إذا لم يكن في هذه
                        التعليمات ما يخالف العقد أو النظام أو الآداب العامة ولم يكن في تنفيذها ما يُعرضه للخطر.
                        <br>
                        ت- يحظر على الموظف العمل لدى الغير سواء بأجر أو بدون أجر بأي حال من الأحوال وذلك أثناء فترة
                        العقد، ويحظر العمل لدى المنافس في مجال المقاولات بعد انتهاء العلاقة العمالية لمدة سنتين داخل
                        المملكة العربية السعودية.
                        <br>
                        ث- أن يعتني عناية كافية بالأجهزة والمعدات والآلات والأدوات المسلمة له بطبيعة عمله المملوكة لصاحب
                        العمل والموضوعة تحت تصرفه أو التي تكون في عهدته وأن يعيدها إلى صاحب العمل غير مستهلكة، وفي حال
                        تسلمه لسيارة فإنه يتحمل المخالفات المسجلة عليها خلال فترة حيازته لها.
                        <br>
                        ج- أن يقدم كل العون والمساعدة دون أن يشترط لذلك أجراً إضافياً في حالات الأخطار التي تهدد سلامة
                        مكان العمل أو الأشخاص العاملين فيه.
                        <br>
                        ح- أن يخضع وفقاً لطلب صاحب العمل للفحوص الطبية التي يرغب في إجرائها عليه قبل الالتحاق بالعمل أو
                        أثناءه للتحقق من خلوه من الأمراض المهنية أو السارية.
                        <br>
                        خ- التقيد بكافة القواعد والسياسات والإجراءات التي تعتمدها الشركة من وقت لآخر.
                        <br>
                        د- الحفاظ على كافة الشهادات والمؤهلات المهنية والقيود اللازمة لتمكينه من تنفيذ مهام عمله بموجب
                        هذا العقد بصورة قانونية.
                        <br>
                        ذ- تكريس كامل وقته واهتمامه وقدراته لأعمال الشركة، ما لم يصب بحالة عجز تحول دون قدرته على ذلك.
                        <br>
                        ر- التقيد بكافة التوجيهات المشروعة قانوناً الصادرة عن صاحب العمل.
                        <br>
                        ز- بذل كل ما في وسعه في تعزيز وحماية وتطوير وتوسيع نطاق أعمال الشركة وتعزيز سمعتها التجارية،
                        واستعمال كافة الصلاحيات وتنفيذ كافة المهام التي يوكله صاحب العمل بها من وقت لآخر بمنتهى الإخلاص
                        والعناية.
                        </p>
                        <h4>المعلومات السرية:</h4>
                        <h5>أقر الموظف وأدرك بأنه سيكون على اطلاع على المعلومات السرية.</h5>
                        <h6>يمتنع الموظف عن المسائل الآتية:</h6>
                        <p>
                        أ- الكشف عن المعلومات السرية لأي شخص أو شركة أو هيئة أو جمعية أو أي كيان آخر لأي سبب من الأسباب
                        باستثناء الوكلاء المفوضين أصولاً من صاحب العمل أو أي كيان من الكيانات التابعة له؛ أو
                        <br>
                        ب- استخدام أو استغلال المعلومات السرية لأغراضه الخاصة أو لأغراض الغير؛ أو
                        <br>
                        ج- إبداء أي تعليقات مسيئة أو تشهيرية حول الشركة أو أي من عملائها أو استشارييها أو مدرائها أو
                        موظفيها أو مسؤوليها أو شركائها أو مساهميها أو مورديها أو وكلائها الحاليين أو السابقين (الأشخاص
                        ذوي الصلة)، ولا يجوز له القيام بأي شيء يترتب عليه الإساءة لسمعة الشركة أو أي شخص من الأشخاص ذوي
                        الصلة؛ أو
                        <br>
                        د- عمل أي نسخ أو سجل أو مذكرة بشأن أي من المعلومات السرية.
                        </p>
                        <h5>
                            أقر الموظف بأن حكم هذا البند الخاص بمبدأ السرية يبقى سارياً أثناء العقد، ولمدة لا تقل عن (15)
                            خمسة عشر سنة بعد إنهاء أو إنتهاء هذا العقد في المملكة العربية السعودية، الرياض، فيما يخص أعمال
                            المقاولات وماله صلة بها.
                        </h5>
                        <h4>الإشعارات:</h4>
                        <p>
                        تكون الاشعارات الموجهة بموجب هذا العقد مكتوبة وموقعة من الطرف الذي وجهه أو من ينوب عنه وتُرسل
                        على العناوين الموضحة في صدر هذا العقد أو عن طريق البرنامج المعتمد بالشركة. وفي حال تم تغيير
                        عناوين البريد الإلكتروني المعنية دون اشعار، سيتم اعتبار عناوين البريد الإلكتروني المذكورة أعلاه
                        إخطاراً صحيحاً بموجب هذا العقد.
                        </p>
                        <h4>الاعتراضات:</h4>
                        <p>
                        يكون الاعتراض على قرارات صاحب العمل على سبيل المثال لا الحصر الإنذارات والخصومات بالراتب وغيره
                        أو تطبيق أي جزاء على الموظف خلال 30 يوم تُرسل على العناوين الموضحة في صدر العقد أو عن طريق
                        البرنامج المعتمد بالشركة، وسكوت الموظف خلال هذه المدة دون إبداء أي اعتراض رسمي يعتبر بمثابة
                        موافقة ضمنية منه على القرار، وفي حال اعتراضه خلال المدة النظامية يتم تشكيل لجنة داخل الشركة
                        للنظر في سبب القرار والاعتراض المقدم.
                        </p>
                        <h4>التكاليف والحوافز:</h4>
                        <p>
                        1- في حال تكليف الموظف بالعمل خارج أوقات العمل الرسمي يشترط أن يكون التكليف معتمد من المدير
                        التنفيذي بخطاب رسمي بتوقيع وختم الشركة أو بإيميل رسمي من المدير التنفيذي، ولا يعتد بأي توجيه
                        شفهي أو تكليف من غير المدير التنفيذي، ويكون اثبات الحضور بنظام البصمة.
                        <br>
                        2- الاتفاقات المالية بين أطراف العقد كالمكافئات أو الحوافز وغيرها، لا تقبل ولا يعمل بها إلا إذا
                        كانت مكتوبة بشكل رسمي وموقعة بين الطرفين وممهورة بختم الشركة.
                        </p>
                        <h4>التغييرات وملحقات عقد العمل:</h4>
                        <p>
                        1- لا يعتد بأي تغيير على هذا العقد ما لم يكن مكتوباً وموقعاً من كل طرف.
                        <br>
                        2- إن أي ملحقات للعقد يتم إبرامها بموافقة الطرفين هي جزء لا يتجزأ من هذا العقد.
                        <br>
                        3- يقر الموظف بأنه اطلع على لائحة تنظيم العمل الداخلية للشركة وعلى علم ببنودها، وأنها من ملحقات
                        العقد.
                        </p>
                        <h4>بنود اضافية:</h4>
                        <p>
                        القانون الواجب التطبيق والاختصاص القضائي:
                        <br>
                        1- يخضع هذا العقد وكل منازعة أو مطالبة تنشأ عنه أو تتعلق به أو بمحله أو بإنشائه (بما في ذلك
                        المنازعات والمطالبات غير التعاقدية) وتفسر جميعها وفقاً للأنظمة المعمول بها في المملكة العربية
                        السعودية، بما فيها نظام العمل ولائحته التنفيذية وأي قرارات صادرة أو قد تصدر بشأن نظام العمل
                        ولائحته التنفيذية.
                        <br>
                        2- وافق الطرفان موافقة لا رجعة فيها على أن تكون الجهات المُختصة المعنية بنظر القضايا العمالية في
                        المملكة العربية السعودية بمدينة الرياض صاحبة الاختصاص القضائي الحصري في نظر وتسوية كل منازعة أو
                        مطالبة تنشأ عن هذا العقد أو تتعلق به أو بمحله أو بإنشائه (بما في ذلك المنازعات والمطالبات غير
                        التعاقدية).
                        <br>
                        </p>
                    </div>
                </div>
                <div class="modal-footer">
                    <button type="button" class="btn btn-secondary"
                            data-bs-dismiss="modal">{{__('main.cancel')}}</button>
                </div>
            </div>
        </div>
    </div>

</div>
@include('employee.layouts.footer-scripts')
</body>
</html>
